espressif/esp-idf/components/soc/esp32c61/register/soc/interrupt_matrix_struct.h
/** Type of core0_src_pass_in_sec_status_1 register
 *  PASS_IN_SEC status register for interrupt sources 32 ~ 63
 */
typedef union {
    struct {
        /** core0_int_src_pass_in_sec_status_1 : RO; bitpos: [31:0]; default: 0;
         *  Represents the PASS_IN_SEC status of the interrupt sources within
         *  interrupt-index-range 32 ~ 63. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS_IN_SEC.
         *  1:The corresponding interrupt source is PASS_IN_SEC.
         */
        uint32_t core0_int_src_pass_in_sec_status_1:32;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_sec_status_1_reg_t;

/** Type of core0_src_pass_in_sec_status_2 register
 *  PASS_IN_SEC status register for interrupt sources 64 ~ 65
 */
typedef union {
    struct {
        /** core0_int_src_pass_in_sec_status_2 : RO; bitpos: [1:0]; default: 0;
         *  Represents the PASS_IN_SEC status of the interrupt sources with
         *  interrupt-index-range 64 ~ 65. Each bit corresponds to one interrupt source
         *  0:The corresponding interrupt source is not PASS_IN_SEC.
         *  1:The corresponding interrupt source is PASS_IN_SEC.
         */
        uint32_t core0_int_src_pass_in_sec_status_2:2;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} interrupt_core0_src_pass_in_sec_status_2_reg_t;

/** Type of core0_secure_status register
 *  reserved
 */
typedef union {
    struct {
        /** core0_int_secure_status : RO; bitpos: [31:0]; default: 0;
         *  reserved
         */
        uint32_t core0_int_secure_status:32;
    };
    uint32_t val;
} interrupt_core0_secure_status_reg_t;


/** Group: Version Register */
/** Type of core0_interrupt_date register
 *  Version control register
 */
typedef union {
    struct {
        /** core0_interrupt_date : R/W; bitpos: [27:0]; default: 38801441;
         *  Version control register
         */
        uint32_t core0_interrupt_date:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} interrupt_core0_interrupt_date_reg_t;


typedef struct {
    volatile interrupt_core0_wifi_mac_intr_map_reg_t core0_wifi_mac_intr_map;
    volatile interrupt_core0_wifi_mac_nmi_map_reg_t core0_wifi_mac_nmi_map;
    volatile interrupt_core0_wifi_pwr_intr_map_reg_t core0_wifi_pwr_intr_map;
    volatile interrupt_core0_wifi_bb_intr_map_reg_t core0_wifi_bb_intr_map;
    volatile interrupt_core0_bt_mac_intr_map_reg_t core0_bt_mac_intr_map;
    volatile interrupt_core0_bt_bb_intr_map_reg_t core0_bt_bb_intr_map;
    volatile interrupt_core0_bt_bb_nmi_map_reg_t core0_bt_bb_nmi_map;
    volatile interrupt_core0_lp_timer_intr_map_reg_t core0_lp_timer_intr_map;
    volatile interrupt_core0_coex_intr_map_reg_t core0_coex_intr_map;
    volatile interrupt_core0_ble_timer_intr_map_reg_t core0_ble_timer_intr_map;
    volatile interrupt_core0_ble_sec_intr_map_reg_t core0_ble_sec_intr_map;
    volatile interrupt_core0_i2c_mst_intr_map_reg_t core0_i2c_mst_intr_map;
    volatile interrupt_core0_zb_mac_intr_map_reg_t core0_zb_mac_intr_map;
    volatile interrupt_core0_pmu_intr_map_reg_t core0_pmu_intr_map;
    volatile interrupt_core0_efuse_intr_map_reg_t core0_efuse_intr_map;
    volatile interrupt_core0_lp_rtc_timer_intr_map_reg_t core0_lp_rtc_timer_intr_map;
    volatile interrupt_core0_lp_wdt_intr_map_reg_t core0_lp_wdt_intr_map;
    volatile interrupt_core0_lp_peri_timeout_intr_map_reg_t core0_lp_peri_timeout_intr_map;
    volatile interrupt_core0_lp_apm_m0_intr_map_reg_t core0_lp_apm_m0_intr_map;
    volatile interrupt_core0_cpu_intr_from_cpu_0_map_reg_t core0_cpu_intr_from_cpu_0_map;
    volatile interrupt_core0_cpu_intr_from_cpu_1_map_reg_t core0_cpu_intr_from_cpu_1_map;
    volatile interrupt_core0_cpu_intr_from_cpu_2_map_reg_t core0_cpu_intr_from_cpu_2_map;
    volatile interrupt_core0_cpu_intr_from_cpu_3_map_reg_t core0_cpu_intr_from_cpu_3_map;
    volatile interrupt_core0_assist_debug_intr_map_reg_t core0_assist_debug_intr_map;
    volatile interrupt_core0_trace_intr_map_reg_t core0_trace_intr_map;
    volatile interrupt_core0_cache_intr_map_reg_t core0_cache_intr_map;
    volatile interrupt_core0_cpu_peri_timeout_intr_map_reg_t core0_cpu_peri_timeout_intr_map;
    volatile interrupt_core0_gpio_interrupt_pro_map_reg_t core0_gpio_interrupt_pro_map;
    volatile interrupt_core0_gpio_interrupt_ext_map_reg_t core0_gpio_interrupt_ext_map;
    volatile interrupt_core0_pau_intr_map_reg_t core0_pau_intr_map;
    volatile interrupt_core0_hp_peri_timeout_intr_map_reg_t core0_hp_peri_timeout_intr_map;
    volatile interrupt_core0_modem_peri_timeout_intr_map_reg_t core0_modem_peri_timeout_intr_map;
    volatile interrupt_core0_hp_apm_m0_intr_map_reg_t core0_hp_apm_m0_intr_map;
    volatile interrupt_core0_hp_apm_m1_intr_map_reg_t core0_hp_apm_m1_intr_map;
    volatile interrupt_core0_hp_apm_m2_intr_map_reg_t core0_hp_apm_m2_intr_map;
    volatile interrupt_core0_hp_apm_m3_intr_map_reg_t core0_hp_apm_m3_intr_map;
    volatile interrupt_core0_cpu_apm_m0_intr_map_reg_t core0_cpu_apm_m0_intr_map;
    volatile interrupt_core0_cpu_apm_m1_intr_map_reg_t core0_cpu_apm_m1_intr_map;
    volatile interrupt_core0_mspi_intr_map_reg_t core0_mspi_intr_map;
    volatile interrupt_core0_i2s1_intr_map_reg_t core0_i2s1_intr_map;
    volatile interrupt_core0_uart0_intr_map_reg_t core0_uart0_intr_map;
    volatile interrupt_core0_uart1_intr_map_reg_t core0_uart1_intr_map;
    volatile interrupt_core0_uart2_intr_map_reg_t core0_uart2_intr_map;
    volatile interrupt_core0_ledc_intr_map_reg_t core0_ledc_intr_map;
    volatile interrupt_core0_usb_intr_map_reg_t core0_usb_intr_map;
    volatile interrupt_core0_i2c_ext0_intr_map_reg_t core0_i2c_ext0_intr_map;
    volatile interrupt_core0_tg0_t0_intr_map_reg_t core0_tg0_t0_intr_map;
    volatile interrupt_core0_tg0_t1_intr_map_reg_t core0_tg0_t1_intr_map;
    volatile interrupt_core0_tg0_wdt_intr_map_reg_t core0_tg0_wdt_intr_map;
    volatile interrupt_core0_tg1_t0_intr_map_reg_t core0_tg1_t0_intr_map;
    volatile interrupt_core0_tg1_t1_intr_map_reg_t core0_tg1_t1_intr_map;
    volatile interrupt_core0_tg1_wdt_intr_map_reg_t core0_tg1_wdt_intr_map;
    volatile interrupt_core0_systimer_target0_intr_map_reg_t core0_systimer_target0_intr_map;
    volatile interrupt_core0_systimer_target1_intr_map_reg_t core0_systimer_target1_intr_map;
    volatile interrupt_core0_systimer_target2_intr_map_reg_t core0_systimer_target2_intr_map;
    volatile interrupt_core0_apb_adc_intr_map_reg_t core0_apb_adc_intr_map;
    volatile interrupt_core0_slc0_intr_map_reg_t core0_slc0_intr_map;
    volatile interrupt_core0_slc1_intr_map_reg_t core0_slc1_intr_map;
    volatile interrupt_core0_dma_in_ch0_intr_map_reg_t core0_dma_in_ch0_intr_map;
    volatile interrupt_core0_dma_in_ch1_intr_map_reg_t core0_dma_in_ch1_intr_map;
    volatile interrupt_core0_dma_out_ch0_intr_map_reg_t core0_dma_out_ch0_intr_map;
    volatile interrupt_core0_dma_out_ch1_intr_map_reg_t core0_dma_out_ch1_intr_map;
    volatile interrupt_core0_gpspi2_intr_map_reg_t core0_gpspi2_intr_map;
    volatile interrupt_core0_sha_intr_map_reg_t core0_sha_intr_map;
    volatile interrupt_core0_ecc_intr_map_reg_t core0_ecc_intr_map;
    volatile interrupt_core0_ecdsa_intr_map_reg_t core0_ecdsa_intr_map;
    volatile interrupt_core0_int_status_reg_0_reg_t core0_int_status_reg_0;
    volatile interrupt_core0_int_status_reg_1_reg_t core0_int_status_reg_1;
    volatile interrupt_core0_int_status_reg_2_reg_t core0_int_status_reg_2;
    volatile interrupt_core0_src_pass_in_sec_status_0_reg_t core0_src_pass_in_sec_status_0;
    volatile interrupt_core0_src_pass_in_sec_status_1_reg_t core0_src_pass_in_sec_status_1;
    volatile interrupt_core0_src_pass_in_sec_status_2_reg_t core0_src_pass_in_sec_status_2;
    volatile interrupt_core0_sig_idx_assert_in_sec_reg_t core0_sig_idx_assert_in_sec;
    volatile interrupt_core0_secure_status_reg_t core0_secure_status;
    volatile interrupt_core0_clock_gate_reg_t core0_clock_gate;
    uint32_t reserved_12c[436];
    volatile interrupt_core0_interrupt_date_reg_t core0_interrupt_date;
} interrupt_matrix_dev_t;

extern interrupt_matrix_dev_t INTMTX;

#ifndef __cplusplus
_Static_assert(sizeof(interrupt_matrix_dev_t) == 0x800, "Invalid size of interrupt_matrix_dev_t structure");
#endif

#ifdef __cplusplus
}
#endif
